app/controllers/answers_controller.rb

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "answers" ("description", "question_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
    def create
      @question = Question.find(params[:question_id])
      @answer = Answer.new(answer_params)
      @answer.question = @question

      if @answer.save