app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions" ORDER BY created_at DESC
---
  def index
    @questions = Question.order("created_at DESC").all

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1 ORDER BY created_at DESC  [["question_id", 1]]
---
  def show
    @question = Question.find(params[:id])
    @answers = @question.answers.order("created_at DESC")

INSERT INTO "questions" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Title of fourth question"], ["description", "Description of fourth question"], ["created_at", 2016-09-21 18:26:18 UTC], ["updated_at", 2016-09-21 18:26:18 UTC]]
---
  def create
    @question = Question.new(question_params)
    if @question.save

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "questions" SET "description" = $1, "updated_at" = $2 WHERE "questions"."id" = $3
---
  def update
    @question = Question.find(params[:id])

    if @question.update(question_params)